tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "gettext"
brew "glib"
brew "libffi"
brew "pcre"
brew "readline"
brew "python@3.9"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bombadillo"
brew "ocaml"
brew "camlp4"
brew "ccache"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "node"
brew "corepack"
brew "coreutils"
brew "croc"
brew "libunistring"
brew "curl"
brew "doxygen"
brew "exa"
brew "expat"
brew "fd"
brew "unbound"
brew "graphite2"
brew "harfbuzz"
brew "mpg123"
brew "pango"
brew "sdl2"
brew "srt"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "flex"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gtk+3"
brew "gtksourceview3"
brew "python@3.8"
brew "gts"
brew "htop"
brew "httpd", restart_service: true
brew "httpie"
brew "jq"
brew "less"
brew "libiconv"
brew "libpq"
brew "libxml2"
brew "lua"
brew "luajit"
brew "lynx"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "opam"
brew "openssl@3"
brew "perl"
brew "php"
brew "pipx"
brew "pygments", link: false
brew "redis", restart_service: true
brew "rename"
brew "rlwrap"
brew "rsync"
brew "tokei"
brew "wget"
brew "z3"
brew "zoxide"
cask "emacs"
cask "font-hack-nerd-font"
cask "inkscape"
cask "mactex-no-gui"
