tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openssl@3"
brew "gettext"
brew "glib"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "libunistring"
brew "curl"
brew "doxygen"
brew "exa"
brew "fd"
brew "unbound"
brew "graphite2"
brew "harfbuzz"
brew "mpg123"
brew "pango"
brew "sdl2"
brew "srt"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "flex"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "pinentry"
brew "readline"
brew "gnupg"
brew "go"
brew "gpgme"
brew "htop"
brew "jq"
brew "less"
brew "libffi"
brew "libiconv"
brew "libunwind-headers"
brew "libxml2"
brew "lua"
brew "luajit"
brew "lynx"
brew "neovim"
brew "ninja"
brew "node"
brew "ocaml"
brew "opam"
brew "pcre"
brew "perl"
brew "pipx"
brew "pygments", link: false
brew "rbenv"
brew "rename"
brew "rsync"
brew "wget"
brew "yarn"
brew "z3"
cask "font-hack-nerd-font"
cask "inkscape"
cask "mactex-no-gui"
