tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openssl@3"
brew "gettext"
brew "readline"
brew "glib"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "libunistring"
brew "curl"
brew "doxygen"
brew "eza"
brew "fd"
brew "unbound"
brew "graphite2"
brew "harfbuzz"
brew "mpg123"
brew "pango"
brew "sdl2"
brew "srt"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gpgme"
brew "htop"
brew "less"
brew "libffi"
brew "libiconv"
brew "libunwind-headers"
brew "libxml2"
brew "z3"
brew "llvm"
brew "lua"
brew "luajit"
brew "neovim"
brew "ninja"
brew "node"
brew "ocaml"
brew "opam"
brew "pcre"
brew "perl"
brew "pygments", link: false
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "wget"
brew "yarn"
cask "font-hack-nerd-font"
cask "inkscape"
cask "mactex-no-gui"
cask "zed"
vscode "amodio.tsl-problem-matcher"
vscode "arcanis.vscode-zipfs"
vscode "artagnon.vsclay"
vscode "azemoh.one-monokai"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.triggertaskonsave"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "llvm-vs-code-extensions.vscode-mlir"
vscode "maximedenes.vscoq"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.hexeditor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ocamllabs.ocaml-platform"
vscode "rreverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "xaver.clang-format"
